/**********************实验板例程************************
*  名称：1T单片机 	 LCD1602
*  晶振:11.0592MHZ
*  硬件设置：
*  使用说明：
******************************************************************/
#ifndef _PCF8591_H_
#define _PCF8591_H_
/*--------------------------------------------------------------------------------------
-函数名称:bit DAC(unsigned char addr,unsigned char Val)
----------------------------------------------------------------------------------------
-函数功能:数据模拟转换函数
-入口参数:addr是芯片地址A2A1A0三个都接地是0,只有A0接高则是1,val是数值(0-255)
-出口参数:操作成功返回1,出错返回0
---------------------------------------------------------------------------------------*/
void DACStart();
void ContinuesSend(unsigned char);
#endif