#include "timer.h"
#include <reg52.h>

/*------------------------------------------------
                    初始化定时器1
------------------------------------------------*/
// void Init_Timer1(void)
// {
// 	TMOD = 0x10;		//设置定时器模式
// 	TL1 = (65536-7)%256;		// 1ms
// 	TH1 = (65536-7)/256;
// 	TF1 = 0;		//清除TF1标志
//     ET1 = 1;
//     EA  = 1;
// 	TR1 = 1;		//定时器1开始计时
// }

void Init_Timer0(void) {
    TMOD = 0x01;		//设置定时器模式
	TL0 = (65536-251)%256;      // 200 Hz for sin wave
	TH0 = (65536-251)/256;      // 200 Hz for sin wave
	TF0 = 0;		//清除TF0标志
    ET0 = 1;
    EA  = 1;
	TR0 = 1;		//定时器0开始计时
}